---
kind: type
id: T:Autodesk.Revit.DB.FilterValueRule
source: html/a1f845ea-fb72-bbc7-10ef-b18a27369be9.htm
---
# Autodesk.Revit.DB.FilterValueRule

A rule that filters on a particular value of an element.

## Syntax (C#)
```csharp
public class FilterValueRule : FilterRule
```